<a href="https://colab.research.google.com/github/glebmikha/sql-course/blob/main/sqlite3_template.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Это апгрейд sqlite3 чтобы были оконные функции.

https://stackoverflow.com/a/59429952/4527289

In [ ]:
!gdown --id 1BSHIKQ7rFw5BpTq5nw1UZfjPK_7Mpnbi
!mv _sqlite3.cpython-37m-x86_64-linux-gnu.so /usr/lib/python3.7/lib-dynload/
import os
os.kill(os.getpid(), 9)

Downloading...
From: https://drive.google.com/uc?id=1BSHIKQ7rFw5BpTq5nw1UZfjPK_7Mpnbi
To: /content/_sqlite3.cpython-37m-x86_64-linux-gnu.so
6.23MB [00:00, 29.0MB/s]

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
import sqlite3

In [ ]:
sqlite3.sqlite_version

'3.34.1'

In [ ]:
con = sqlite3.connect('db')

In [ ]:
cur = con.cursor()

In [ ]:
def select(sql):
  return pd.read_sql(sql,con)

In [ ]:
sql = '''Create table If Not Exists Employee (Id int, Salary int)
insert into Employee (Id, Salary) values ('1', '100')
insert into Employee (Id, Salary) values ('2', '200')
insert into Employee (Id, Salary) values ('3', '300')'''

In [ ]:
sql = ';\n'.join(sql.split('\n'))

In [ ]:
print(sql)

Create table If Not Exists Employee (Id int, Salary int);
insert into Employee (Id, Salary) values ('1', '100');
insert into Employee (Id, Salary) values ('2', '200');
insert into Employee (Id, Salary) values ('3', '300')

In [ ]:
cur.executescript(sql)

In [ ]:
sql = '''select * from Employee t'''

In [ ]:
select(sql)

   Id  Salary
0   1     100
1   2     200
2   3     300